## Lab 3:필요한 변수 추출하기 -df['컬럼 이름 ']

In [1]:
import pandas as pd
exam = pd.read_csv('exam.csv')
exam.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [2]:
# math 변수만 추출(시리즈)
exam['math'].head()

0    50
1    60
2    45
3    30
4    25
Name: math, dtype: int64

In [3]:
# math 변수만 추출(데이터 프레임)
exam[['math']].head()

   math
0    50
1    60
2    45
3    30
4    25

### 변수 제거하기 - df.drop(columns='칼럼이름')

In [4]:
# 변수 math 제거
# (주의)math가 제거된 테이블이 반환되어 출력된다.
exam.drop(columns='math').head()

   id  nclass  english  science
0   1       1       98       50
1   2       1       97       60
2   3       1       86       78
3   4       1       98       58
4   5       2       80       65

In [5]:
# 원래 데이터프레임은 변경 없음
exam.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [6]:
# 변수 english, science 제거
exam.drop(columns = ['english','science']).head()

   id  nclass  math
0   1       1    50
1   2       1    60
2   3       1    45
3   4       1    30
4   5       2    25

### Pandas 함수 조합하기

In [7]:
# 2반 데이터의 변수 nclass만 추출(데이터 프레임)
exam.query('nclass==2')[['nclass']]

   nclass
4       2
5       2
6       2
7       2

## Lab 4(혼자 해보기): mpg 데이터 다루기

Q1: mpg 데이터에서 category(자동차 종류)와 cty(도시 연비) 변수를 추출하여 새로운 데이터를 만드시오

In [8]:
import pandas as pd
mpg = pd.read_csv("mpg.csv")
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl category
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
3         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
4         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [9]:
mpg_new = mpg[['category','cty']]
mpg_new.head()

  category  cty
0  compact   18
1  compact   21
2  compact   20
3  compact   21
4  compact   16

Q2: 추출한 데이터를 이용하여 category가 'suv'인 자동차와 'compact' 자동차의 도시연비(cty)를 비교해 보시오

In [10]:
mpg_new.query("category=='suv'")['cty'].mean()

13.5

In [11]:
mpg_new.query("category=='compact'")['cty'].mean()

20.127659574468087